import { IBookInfoMock } from "../components/Card/types/types"

export const cardInfoMock: IBookInfoMock[] = [
    {
        id: 0,
        img: [],
        rating: '',
        title: 'Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих',
        author: 'Адитья Бхаргава, 2019',
        isBooked: false,
        busyUntil: '',
        category: 'computer-science',
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в лубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        publishing: 'Питер',
        year: '2019',
        pages: '288',
        binding: 'Мягкая обложка',
        format: '70х100',
        genre: 'Компьютерная литература',
        weight: '370г',
        ISBN: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198 206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        feedbacks: [
            {
                id: 0,
                name: 'Иван Иванов',
                date: '19 января 2019',
                rating: '4',
                comment: ''
            },
            {
                id: 1,
                name: 'Николай Качков',
                date: '20 июня 2018',
                rating: '4',
                comment: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.'
            },
            {
                id: 2,
                name: 'Екатерина Беляева',
                date: '18 февраля 2018',
                rating: '4',
                comment: ''
            },
        ]
    },
    {
        id: 1,
        img: ['book.png'],
        rating: '4',
        title: 'Программирование на JAVA',
        author: 'Патрик Нимейер, Дэниэл Леук, 2013',
        isBooked: false,
        busyUntil: '',
        category: 'computer-science',
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в лубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        publishing: 'Питер',
        year: '2019',
        pages: '288',
        binding: 'Мягкая обложка',
        format: '70х100',
        genre: 'Компьютерная литература',
        weight: '370г',
        ISBN: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198 206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        feedbacks: [
            {
                id: 0,
                name: 'Иван Иванов',
                date: '19 января 2019',
                rating: '4',
                comment: ''
            },
            {
                id: 1,
                name: 'Николай Качков',
                date: '20 июня 2018',
                rating: '4',
                comment: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.'
            },
            {
                id: 2,
                name: 'Екатерина Беляева',
                date: '18 февраля 2018',
                rating: '4',
                comment: ''
            },
        ]
    },
    {
        id: 2,
        img: ['book.png', 'book1.png', 'book2.png'],
        rating: '4',
        title: 'Как создать сайт. Комикс-путеводитель по HTML, CSS и WordPress',
        author: 'Джи Ким, Нейт Купер, 2019',
        isBooked: false,
        busyUntil: '03.05',
        category: 'computer-science',
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в лубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        publishing: 'Питер',
        year: '2019',
        pages: '288',
        binding: 'Мягкая обложка',
        format: '70х100',
        genre: 'Компьютерная литература',
        weight: '370г',
        ISBN: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198 206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        feedbacks: [
            {
                id: 0,
                name: 'Иван Иванов',
                date: '19 января 2019',
                rating: '4',
                comment: ''
            },
            {
                id: 1,
                name: 'Николай Качков',
                date: '20 июня 2018',
                rating: '4',
                comment: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.'
            },
            {
                id: 2,
                name: 'Екатерина Беляева',
                date: '18 февраля 2018',
                rating: '4',
                comment: ''
            },
        ]
    },
    {
        id: 3,
        img: ['book.png', 'book1.png', 'book2.png', 'book3.png', 'book4.png'],
        rating: '4',
        title: 'HTML5 и CSS3. Разработка сайтов для любых браузеров и устройств',
        author: 'Бен Фрейн, 2014',
        isBooked: false,
        busyUntil: '',
        category: 'computer-science',
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в лубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        publishing: 'Питер',
        year: '2019',
        pages: '288',
        binding: 'Мягкая обложка',
        format: '70х100',
        genre: 'Компьютерная литература',
        weight: '370г',
        ISBN: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198 206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        feedbacks: [
            {
                id: 0,
                name: 'Иван Иванов',
                date: '19 января 2019',
                rating: '4',
                comment: ''
            },
            {
                id: 1,
                name: 'Николай Качков',
                date: '20 июня 2018',
                rating: '4',
                comment: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.'
            },
            {
                id: 2,
                name: 'Екатерина Беляева',
                date: '18 февраля 2018',
                rating: '4',
                comment: ''
            },
        ]
    },
    {
        id: 4,
        img: ['book.png'],
        rating: '4',
        title: 'Adobe Flash. Создание аркад, головоломок и других игр с помощью ActionScript',
        author: 'Гэри Розенцвейг, 2009',
        isBooked: true,
        busyUntil: '',
        category: 'computer-science',
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в лубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        publishing: 'Питер',
        year: '2019',
        pages: '288',
        binding: 'Мягкая обложка',
        format: '70х100',
        genre: 'Компьютерная литература',
        weight: '370г',
        ISBN: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198 206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        feedbacks: [
            {
                id: 0,
                name: 'Иван Иванов',
                date: '19 января 2019',
                rating: '4',
                comment: ''
            },
            {
                id: 1,
                name: 'Николай Качков',
                date: '20 июня 2018',
                rating: '4',
                comment: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.'
            },
            {
                id: 2,
                name: 'Екатерина Беляева',
                date: '18 февраля 2018',
                rating: '4',
                comment: ''
            },
        ]
    },
    {
        id: 5,
        img: [],
        rating: '',
        title: 'Грокаем алгоритмы. Иллюстрированное ',
        author: '2013',
        isBooked: false,
        busyUntil: '23.04',
        category: 'computer-science',
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в лубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        publishing: 'Питер',
        year: '2019',
        pages: '288',
        binding: 'Мягкая обложка',
        format: '70х100',
        genre: 'Компьютерная литература',
        weight: '370г',
        ISBN: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198 206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        feedbacks: [
            {
                id: 0,
                name: 'Иван Иванов',
                date: '19 января 2019',
                rating: '4',
                comment: ''
            },
            {
                id: 1,
                name: 'Николай Качков',
                date: '20 июня 2018',
                rating: '4',
                comment: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.'
            },
            {
                id: 2,
                name: 'Екатерина Беляева',
                date: '18 февраля 2018',
                rating: '4',
                comment: ''
            },
        ]
    },
    {
        id: 6,
        img: ['book.png', 'book1.png', 'book2.png'],
        rating: '4',
        title: 'HTML5. Разработка приложений для мобильных устройств',
        author: 'Эстель Вейл, 2015',
        isBooked: false,
        busyUntil: '',
        category: 'computer-science',
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в лубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        publishing: 'Питер',
        year: '2019',
        pages: '288',
        binding: 'Мягкая обложка',
        format: '70х100',
        genre: 'Компьютерная литература',
        weight: '370г',
        ISBN: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198 206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        feedbacks: [
           {
                id: 0,
                name: 'Иван Иванов',
                date: '19 января 2019',
                rating: '4',
                comment: ''
            },
            {
                id: 1,
                name: 'Николай Качков',
                date: '20 июня 2018',
                rating: '4',
                comment: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.'
            },
            {
                id: 2,
                name: 'Екатерина Беляева',
                date: '18 февраля 2018',
                rating: '4',
                comment: ''
            },
        ]
    },
    {
        id: 7,
        img: ['book.png', 'book1.png'],
        rating: '4',
        title: 'Быстро и легко создаем, программируем и раскручиваем',
        author: 'Олег Поломошнов, 2011',
        isBooked: false,
        busyUntil: '',
        category: 'computer-science',
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в лубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        publishing: 'Питер',
        year: '2019',
        pages: '288',
        binding: 'Мягкая обложка',
        format: '70х100',
        genre: 'Компьютерная литература',
        weight: '370г',
        ISBN: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198 206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        feedbacks: [
          {
                id: 0,
                name: 'Иван Иванов',
                date: '19 января 2019',
                rating: '4',
                comment: ''
            },
            {
                id: 1,
                name: 'Николай Качков',
                date: '20 июня 2018',
                rating: '4',
                comment: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.'
            },
            {
                id: 2,
                name: 'Екатерина Беляева',
                date: '18 февраля 2018',
                rating: '4',
                comment: ''
            },
        ]
    },
    {
        id: 8,
        img: ['book.png', 'book1.png', 'book2.png', 'book3.png', 'book4.png', 'book5.png', 'book6.png'],
        rating: '4',
        title: 'Грокаем алгоритмы. Иллюстрированное ',
        author: 'Борис Пахомов, 2014',
        isBooked: false,
        busyUntil: '',
        category: 'computer-science',
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в лубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        publishing: 'Питер',
        year: '2019',
        pages: '288',
        binding: 'Мягкая обложка',
        format: '70х100',
        genre: 'Компьютерная литература',
        weight: '370г',
        ISBN: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198 206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        feedbacks: [
           {
                id: 0,
                name: 'Иван Иванов',
                date: '19 января 2019',
                rating: '4',
                comment: ''
            },
            {
                id: 1,
                name: 'Николай Качков',
                date: '20 июня 2018',
                rating: '4',
                comment: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.'
            },
            {
                id: 2,
                name: 'Екатерина Беляева',
                date: '18 февраля 2018',
                rating: '4',
                comment: ''
            },
        ]
    },
    {
        id: 9,
        img: [],
        rating: '',
        title: 'Грокаем алгоритмы. Иллюстрированное пособие для програ...',
        author: 'Адитья Бхаргава, 2019',
        isBooked: false,
        busyUntil: '',
        category: 'computer-science',
        about: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в лубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        publishing: 'Питер',
        year: '2019',
        pages: '288',
        binding: 'Мягкая обложка',
        format: '70х100',
        genre: 'Компьютерная литература',
        weight: '370г',
        ISBN: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198 206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        feedbacks: [
          {
                id: 0,
                name: 'Иван Иванов',
                date: '19 января 2019',
                rating: '4',
                comment: ''
            },
            {
                id: 1,
                name: 'Николай Качков',
                date: '20 июня 2018',
                rating: '4',
                comment: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.'
            },
            {
                id: 2,
                name: 'Екатерина Беляева',
                date: '18 февраля 2018',
                rating: '4',
                comment: ''
            },
        ]
    },
]
